In [3]:
# 판다스로 데이터프레임으로 팀원 세명의 정보를 입력하기
# 이름, 성별, 나이
import pandas as pd
team = pd.DataFrame([["서희창", "이진헌", "박성화"],
                 ["남", "남", "남"],
                 [30, 26, 40]],
          index=["이름","성별","나이"])
print(team)

      0    1    2
이름  서희창  이진헌  박성화
성별    남    남    남
나이   30   26   40

In [6]:
team = pd.DataFrame([["서희창", "남자", 30],
                     ["이진헌", "남자", 26],
                     ["박성화", "남자", 40]],
                     index=["1번", "2번", "3번"],
                     columns=["이름", "성별", "나이"])

print(team)

     이름  성별  나이
1번  서희창  남자  30
2번  이진헌  남자  26
3번  박성화  남자  40

In [ ]:
# 데이터프레임으로 딕셔너리로 만들어보기  => key : 컬럼명, 밸류 : 데이터
team_dict = pd.DataFrame({"이름" : ["서희창", "이진헌", "박성화"],
                          "성별" : ["남자", "남자", "남자"],
                          "나이" :[30, 26, 40]},
                          index=["1번", "2번", "3번"])
print(team_dict)

     이름  성별  나이
1번  서희창  남자  30
2번  이진헌  남자  26
3번  박성화  남자  40

In [11]:
# 행 인덱싱 => 불가능 오류가난다.
# team[0]
# 행 슬라이싱 => 1번과 2번이 적혀있는 행 자체를 가지고오고싶다. 
team[0:2:1]
# 행 슬라이싱 => index 명으로도 가능하다. 
team["1번":"2번":1]

     이름  성별  나이
1번  서희창  남자  30
2번  이진헌  남자  26

In [ ]:
# 열 인덱싱 = > 가능하다. DF 명 ["컬럼명"]
team["이름"]

# 열 슬라이싱 => 불가능 
team["이름":"성별":1] # 불가능하다.

1번    서희창
2번    이진헌
3번    박성화
Name: 이름, dtype: object

# 불편함을 해결하고자 👍indexer 등장!!!! 
# - 데이터 프레임의 행, 열에 편리한 접근 위해 존재
# - loc(location), iloc(index location)
# - loc : 실제로 보이는 이름으로 데이터 접근
# - iloc : 인덱스 번호로 데이터 접근
# - .인덱서[행,열]

In [ ]:
# 행 인덱싱 => 불가능해 => indexer 사용으로 해결하자 => team.loc["1번"], team.iloc[0]
team.loc["1번"] # loc는 인덱스 명으로 접근
team.iloc[0] # iloc는 인덱스 번호로 접근

이름    서희창
성별     남자
나이     30
Name: 1번, dtype: object

In [ ]:
# 행 추가 CRUD Create,Read, Update, Delete
team.loc["4번"] = ["이광민", "남자", 26]
team

     이름  성별  나이
1번  서희창  남자  30
2번  이진헌  남자  26
3번  박성화  남자  40
4번  이광민  남자  26

In [ ]:
# 열 슬라이싱 => 불가능해 => indexer 사용으로 해결하자 => team.loc[:, "이름":"성별"], team.iloc[:, 0:2]
# 열과 행을 같이 가져와야한다. 행[0:2:1], 열[0:2:1]
team.iloc[0:3:2, 0:3:2]


# 행과 열을 같이 가져와야한다 행["1번":"2번":1], 열["이름": "성별": 1]
team.loc["1번": "4번" : 2 , "이름": "나이": 2]

     이름  나이
1번  서희창  30
3번  박성화  40

In [ ]:
# 1개만 가지고오고싶다. 
# indexer 사용해서 행,열 가져온다.
team.loc["1번","이름"]

'서희창'

In [ ]:
import pandas as pd

In [ ]:
# 판다스 실습

# population.csv 파일 불러오기 .read_csv() 함수 사용
population = pd.read_csv("./data/population.csv", encoding="utf-8")
population


# pd.read_html("../web/css/20250709_ex05_div.html", encoding="utf-8")

   도시   지역     2020        2015        2010      2005
0  서울  수도권  9668465  10022181.0  10312545.0  10167344
1  부산  경상권  3391946         NaN         NaN   3628293
2  인천  수도권  2942828   2925815.0         NaN   2600495
3  광주  전라권  1450062   1474636.0   1454636.0   1401745
4  대구  경상권  2418436   2466052.0   2431774.0   2456016

#### pandas DataFrame에서 CRUD 작업은 다음과 같이 수행됩니다:

- 연산	주요 메서드	설명
- Create	pd.concat(), loc[], insert()	새로운 행/열 추가
- Read	loc[], iloc[], query(), head()	데이터 조회 및 필터링
- Update	loc[], iloc[], at[], iat[]	기존 데이터 수정
- Delete	drop(), del	행/열 삭제

In [ ]:
# dataframe을 불러와서 index를 도시로 설정하기
# index_col="도시"를 사용하여 도시를 인덱스로 설정한다.
population = pd.read_csv("./data/population.csv", index_col = "도시", encoding="utf-8")
population

     지역     2020        2015        2010      2005
도시
서울  수도권  9668465  10022181.0  10312545.0  10167344
부산  경상권  3391946         NaN         NaN   3628293
인천  수도권  2942828   2925815.0         NaN   2600495
광주  전라권  1450062   1474636.0   1454636.0   1401745
대구  경상권  2418436   2466052.0   2431774.0   2456016

In [ ]:
# 인덱스명 기준 오름차순으로 보여준다.sort_index() 
population.sort_index()

     지역     2020        2015        2010      2005
도시
광주  전라권  1450062   1474636.0   1454636.0   1401745
대구  경상권  2418436   2466052.0   2431774.0   2456016
부산  경상권  3391946         0.0         0.0   3628293
서울  수도권  9668465  10022181.0  10312545.0  10167344
인천  수도권  2942828   2925815.0         0.0   2600495

In [ ]:
# 열 인덱싱 후 데이터 기준 오름차순으로 보기 =>  기본값은 오름차순(ascending 오름차순=False)이다.
population["2010"].sort_values(ascending=False)  # 2010년 인구를 기준으로 내림차순 decending (어센딩:오름차순 ascending=False) 정렬 속성: aggregate

도시
광주     1454636.0
대구     2431774.0
서울    10312545.0
부산           NaN
인천           NaN
Name: 2010, dtype: float64

In [ ]:
# by agrgate
# 데이터프레임 내 2010년만을 기준 모든데이터 오름차순 보여주기 
population.sort_values(by="2010")

     지역     2020        2015        2010      2005
도시
광주  전라권  1450062   1474636.0   1454636.0   1401745
대구  경상권  2418436   2466052.0   2431774.0   2456016
서울  수도권  9668465  10022181.0  10312545.0  10167344
부산  경상권  3391946         NaN         NaN   3628293
인천  수도권  2942828   2925815.0         NaN   2600495

In [ ]:
# 지역을 기준으로 오름차순, 지역이 같을경우 2020년 컬럼 기준으로 오름차순 by=["지역", "2020"] by aggregate는 리스트도 가능하다.

population.sort_values(by = ["지역","2020"])
# 응용 population.sort_values(by = ["지역","2020"], ascending=[True, False])  # 지역을 기준으로 오름차순, 지역이 같을경우 2020년 컬럼 기준으로 오름차순 by=["지역", "2020"] by aggregate는 리스트도 가능하다.
# 에러 population.sort_values(by = ["지역","2020"], descending=[True, False])  # 지역을 기준으로 오름차순, 지역이 같을경우 2020년 컬럼 기준으로 오름차순 by=["지역", "2020"] by aggregate는 리스트도 가능하다.

     지역     2020        2015        2010      2005
도시
대구  경상권  2418436   2466052.0   2431774.0   2456016
부산  경상권  3391946         NaN         NaN   3628293
인천  수도권  2942828   2925815.0         NaN   2600495
서울  수도권  9668465  10022181.0  10312545.0  10167344
광주  전라권  1450062   1474636.0   1454636.0   1401745

In [ ]:
# count 함수 
# 각 행, 열별로 몇개의 행이 있는지 확인한다.(NaN 제외) => 컬럼을기준으로 row가 몇개인가 확인하고싶을때. count(axis= row = 0)
population.count()
# population.count(axis=0) default axis=0

지역      5
2020    5
2015    4
2010    3
2005    5
dtype: int64

In [ ]:
# 몇개의 열이 있는지 확인한다.(NaN제외).count(axis = column = 1)
population.count(axis=1) 
# population.count(axis=1)  # axis=1은 행을 기준으로 카운트한다.

도시
서울    5
부산    3
인천    4
광주    5
대구    5
dtype: int64

In [ ]:
# 결측치(NaN)를 원한느 데이터로 변경하기
# 결측치의 연산은 결측치로 나오기 때문!
# fillna() 함수 사용 => 변수명.fillna(value=0) => fill NaN의 약자. 
# int64 bit로 변경해주는것
population.fillna(value=0, inplace=True)  # inplace=True는 원본 데이터에 적용한다는 의미이다. 기본값은 False로 원본 데이터는 변경되지 않는다.
population.dtypes
population.astype({"2010":"int64"})

     지역     2020        2015      2010      2005
도시
서울  수도권  9668465  10022181.0  10312545  10167344
부산  경상권  3391946         0.0         0   3628293
인천  수도권  2942828   2925815.0         0   2600495
광주  전라권  1450062   1474636.0   1454636   1401745
대구  경상권  2418436   2466052.0   2431774   2456016